// **************************************************************************************************************************************************************************
// Bogdan Stashchuk
// https://www.youtube.com/watch?v=CxgOKJh4zWE

// ТЕМА: Самое важное в JavaScript.

/*

*** 20:17 Самое важное в JavaScript
Самое важное в JavaScript это:
- Выражения
- Функции
- Объекты

Это три ключевых понятия в JavaScript которые вы должны понимать - если вы их будете понимать, понимание JavaScript в целом на много упростится.

*/