/*

1. Три самых важных ключевых понятия в JS:
- Выражения
- Функции
- Объекты

2. Все (любые) сущности в JavaScript это - объекты:
Массив - это Объект
Функция - это Объект
Число - это Объект* (но только ведет себя как Объект, на самом деле оно является Примитивным значением)
Строка - это Объект* (но только ведет себя как Объект, на самом деле оно является Примитивным значением)

3. Объект - это набор свойств:
ИМЯ: ЗНАЧЕНИЕ
или
КЛЮЧ: ЗНАЧЕНИЕ

4. Объект находится между парой фигурных скобок {}
Пример объекта:
{
  visible: true,
  colorDepth: 24,
  title: 'My Image'
}

5. У некоторых свойств значением может быть также объект - такие объекты называются вложенными объектами:
orientation: {
  angle: 0,
  type: 'Landscape'
}

*/