// **************************************************************************************************************************************************************************
// Bogdan Stashchuk
// https://www.youtube.com/watch?v=CxgOKJh4zWE


/*
00:00 Введение
07:38 Как выполнять код
20:17 Самое важное в JavaScript
23:29 Что такое console log
32:24 Выражения
41:24 Переменные
49:43 Объявление переменных
59:41 Практика по созданию переменных
01:06:29 Примитивные типы
01:12:27 Ссылочный тип
01:28:38 Динамическая типизация
01:39:38 Объекты
01:45:18 Создание и удаление свойств объектов
01:55:58 Вложенные свойства
01:59:18 Сокращенный формат записи свойств
02:03:28 Глобальные объекты
02:09:01 Методы объекта
02:14:17 JSON - JavaScript Object Notation
02:25:17 Мутация в JavaScript
02:32:26 Как избежать мутаций объектов
02:42:11 Что такое функция
02:50:15 Объявление и вызов функции
03:00:25 Передача значения по ссылке
03:07:36 Колбэк функции
03:16:45 Области видимости
03:22:26 Цепочка областей видимости
03:28:05 Жизненный цикл переменных
03:36:38 Типы областей видимости
03:41:19 Строгий режим
03:44:05 Операторы
03:49:50 Оператор присваивания
03:53:33 Унарные и бинарные операторы
03:57:34 Форматы записи операторов
03:59:53 Приоритетность операторов
04:03:20 Логические операторы
04:04:47 Ложные значения
04:07:58 Практика с typeof оператором
04:10:57 Оператор НЕ
04:13:39 Операторы короткого замыкания И
04:16:47 Оператор короткого замыкания ИЛИ
04:20:18 Трюк с оператором И и вызовом функции
04:26:06 Оператор разделения объекта на свойства
04:31:34 Конкатенация строк
04:38:01 Функциональные выражения
04:45:44 Стрелочные функции
04:53:59 Значения параметров функции по умолчанию
05:08:22 Обработка ошибок
05:17:26 Инструкции
05:23:44 Выражения-инструкции
05:28:27 Как отличить инструкцию от выражения
05:34:39 Массивы
05:42:03 Оператор сравнения для массивов и объектов
05:44:35 Массив против Объекта
05:55:37 Методы массивов
06:05:15 Метод forEach
06:12:28 Метод map
06:20:02 Деструктуризация объектов
06:24:33 Деструктуризация массивов
06:27:53 Деструктуризация параметров функции
06:34:09 Условные инструкции
06:43:04 Условная инструкция if else
06:55:40 Использование if в функциях
07:03:18 Инструкция Switch
07:08:18 Тернарный оператор
07:22:04 Циклы
07:25:48 Цикл for
07:31:08 Для перебора массивов не нужен for
07:36:51 Цикл while
07:40:13 Цикл do while
07:42:59 Цикл for in
07:45:42 Методы keys и values для объектов
07:51:11 Цикл for in для массивов
07:52:43 Цикл for of
07:57:21 Модули
08:05:07 Создание и запуск модулей с помощью Node
08:18:33 Несколько экспортов
08:23:11 Правила работы с модулями
08:26:18 Практика по созданию нескольких экспортов
08:30:30 Как используются модули в React
08:37:05 Введение в классы и прототипы
08:41:09 Пример класса
08:49:23 Создание экземпляров класса
08:55:40 Цепочка прототипов
08:58:42 Вызов унаследованных методов
09:02:08 Практика по созданию классов и экземпляров
09:11:22 Проверка принадлежности свойств объектов
09:16:04 Статические методы
09:19:06 Практика по созданию статических методов
09:23:12 Расширение других классов
09:30:47 Что же такое прототип
09:37:51 Введение в промисы
09:43:57 Создание и использование промисов
09:51:54 Использование промисов в fetch
10:00:25 Практика по использованию промисов и fetch
10:12:20 Практика с отклонением промисов
10:15:29 Вызов fetch внутри промиса
10:23:28 Асинхронные функции
10:48:17 Обработка ошибок в асинхронных функциях
10:51:56 Ключевые принципы в async await
*/