// **************************************************************************************************************************************************************************
// Bogdan Stashchuk
// https://www.youtube.com/watch?v=CxgOKJh4zWE

/*
Переменные.
Что же такое переменные?
Переменные дают возможность повторного доступа к значениям.
Это лучшее определение на мой взгляд.

Почему это важно?
Давайте снова вернемся к кносоли.
=====================
---------------------
> 10
<. 10
---------------------
> 5 + 2
<. 7
---------------------
> 'Good ' + 'Evening'
<. 'Good Evening'
---------------------
=====================


Когда мы вводили такие цифры как 
10
5 + 2
и .т.д.
Эти выражения интерпретатор JS получал эти выражения, возвращал нам результаты этих выражений, например 
10
и
7
но нигде не сохранял эти цифры 
10
5
2
и
7
Цифры нигде не сохранялись, точно также как и результаты этого выражения 
'Good ' + 'Evening'

Но если вы хотите обратиться к какому-либо значению позже, т.е. прочитать его, вы должны присвоить значение переменной.
И только таким образом вы сможете обратиться позже к этому же значению.
Кроме того вы можете перезаписывать значения тех или иных переменных.

Снова таки:
Переменные - дают возможность повторного доступа к значениям, которые присвоены этим переменным.
0:42:55

Мы можем рассматривать переменную как коробку и я могу положить в эту коробку например свое имя:
Jim
И на этой коробке мы можем написать название, например:
myName
И, в дальнейшем, мы можем обратиться к значению этой коробки, т.е. распаковать коробку, посмотреть какое значение там находится и выполнить какие-нибудь действия с этим 
значением.
Кроме того можно достать одно значение с этой коробки и положить туда другое значение.

Если у вас много таких коробок с разными названиями, вы можете также выполнять различные действия, например объединение значений.
Например если у вас есть две строки, которые присвоены разным переменным, вы можете объединить эти значения и получить новую строку на выходе.
Но воспринимайте переменные просто как контейнеры для хранения значений, не более того.
0:43:56

*/