
console.log('Hello world') // Стандартное отображение значения в консоли.

console.dir(console) // С помощью этого метода можно отобразить в консоли все свойства того или иного объекта.

console.table(console) // С помощью table можно в консоли увидеть все свойства того или иного объекта, где свойства объекта будут отображены в виде таблицы.

//
console.log(console.log('Name')) 
/* console.log('Name') нужен в качестве аргумента для выражения console.log(), чтобы отобразить возвращаемый интерпретатором ответ - т.е. значение.
Строка undefined - это значение, которое возвращает функция log.
*/

// 
console
