// **************************************************************************************************************************************************************************
// Bogdan Stashchuk
// https://www.youtube.com/watch?v=CxgOKJh4zWE

/* 1.48.31 Создание_и_удаление_свойств_объектов
*/

// Добавляем новое свойство в объект
const myCity = {
    city: 'New York'
}

myCity.popular = true // Создание нового свойства через точечную запись.
console.log('Cвойства myCity:', myCity) // Проверяем добавление свойства.

// Обратите внимание - при изменении свойств объекта, сама ссылка на объект не меняется. Поэтому даже при const объект поддается изменению.
// Остановился на 1:47:01



