// **************************************************************************************************************************************************************************
// Bogdan Stashchuk
// https://www.youtube.com/watch?v=CxgOKJh4zWE

// ТЕМА: Принцип 80/20.

/*

Итак, давайте начинать наш JAVA SCRIPT курс и я хочу начать с того, что же такое принцип 80/20.
Этот принцип применим не только к изучению языка JS, это общий принцип.
Приведу пример:
У меня есть набор с инструментами, в котором около 50 различных инструментов, но пользуюсь я чаще всего 3-5 инструментами из этого большого ящика.
Т.е вы можете владеть всем абсолютно спектром функций джс, но при этом будете применять только небольшую часть.
Вот именно на основных фунциях джс я и буду концентрировать ваше внимание в этом курсе.
Один и тот же блок кода можно на самом деле написать несколькими разными способами, но вам не обязательно знать все эти способы - достаточно одного способа. И это принцип 
80/20.
0:07:37.

*/