// **************************************************************************************************************************************************************************
// Bogdan Stashchuk
// https://www.youtube.com/watch?v=CxgOKJh4zWE

// ОТВЕТЫ


/* 1. Самое важное в выражении, это то что оно всегда возыращает значение. */

/* 2. Примеры некоторых выражений:

Если написать строку 'abc', то интерпретатор вернет эту же строку 'abc'

Если написать число 10, то интерпретатор вернет это же значение 10

Если написать 5 + 2 результатом выражения с использованием оператора + будет число 7

Если написать с = 10 результатом выражения с использованием оператора = будет значение число 10

Если написать 'Good ' + 'Evening' результатом выражения с использованием конкатенацией строк с помощью оператора + будет значение 'Good Evening'

Если написать выражение с несколькими операторами a <= b || c !== d 
<= меньше либо равно
|| или
!== не равно

Если написать myFunction(c, d) то вызов функции тоже приведет к возвращению значения 
*/

// ОСТАНОВИЛСЯ ЗДЕСЬ 0:35:19

/* 3. 


*/
