// **************************************************************************************************************************************************************************
// Bogdan Stashchuk
// https://www.youtube.com/watch?v=CxgOKJh4zWE


// 0_38_30_Выражения_с_побочными_действиями - что это такое?
a = 5

b++

myFunction(c, d)

/*
Выражения, которые не только возвращают значение, но и выполняют какие-то действия,
называются выражением с побочными дейтвиями.
На английском - Side Effects.

Давайте более детально:
a = 5
мы используем оператор присваивания и это выражение вернет значение, в данном примере
5
Но кроме возвращения значения это выражение также приведет к выполениею действия. 
А именно это значение
5
будет присвоено переменной
a
и позже, в коде вы можете обратиться к этой переменной и прочесть это значение - выполнили какие-то побочные действия,
кроме возврата непосредственно значения этого выражения.
0:39:34







*/

















