// **************************************************************************************************************************************************************************
// Bogdan Stashchuk
// https://www.youtube.com/watch?v=CxgOKJh4zWE

/*
Объявление переменных.
В JS есть три ключевых слова, с помощью которых объявляются переменные =>
let
const
var

let
и
const
появились в ECMAScript 6.

ECMAScript - это стандарт JS, который описывает полностью все функции JS.
А уже различные веб браузеры, Node.js - применяют этот стандарт.

ECMAScript 6 - появился в 2015году, именно тогда появились такие ключевые слова как
let
и
const
с помощью которых можно объявлять новые переменные.

var
присутствовал в программировании JS с самого начала и ранее с помощью
var
и только с помощью 
var
определялись переменные.

Сейчас же не рекомендуется использовать 
var
а рекомендуется использовать только
let
и
const

Потому я вам рекомендую забыть о 
var
если вы будете писать каки-то новые приложения либо будете тренироваться в изучении языка JS - использовать только
let 
и 
const
0:50:55









*/