// **************************************************************************************************************************************************************************
// Bogdan Stashchuk
// https://www.youtube.com/watch?v=CxgOKJh4zWE

/* 
Выражение присваивания значения переменной, без объявления переменной:
a = 20
console.log(a)
 
a = 20
В выражении присваивания присутствует оператор 
=
Он стоит между названием переменной
a
и справа от этого оператора находится число, например
20

Конечно же можете присвоить переменной все что угодно:
объекты
строку
булево значение true или false
и т.д. что угодно.
Но важно понимать, что оператор присвоения как в данном примере
a = 20
используется в выражении, т.е. то что вы видите сейчас
a = 20
это выражение, в котором значение присваивается переменной.
Обратите внимание что здесь мы не объявляем переменную
a
мы здесь присваиваем только значение.
*/